Revit.Elements.DividedSurface
A Revit DividedSurface

Revit.Elements.DividedSurface.#ctor(Autodesk.Revit.DB.DividedSurface)
Construct from an existing Element.  The resulting object is Dynamo owned.
divSurf:

Revit.Elements.DividedSurface.#ctor(Revit.GeometryReferences.ElementFaceReference,System.Int32,System.Int32,System.Double)
Private constructor for creating a divided surface
elementFace:
uDivs:
vDivs:
rotation:

Revit.Elements.DividedSurface.InitDividedSurface(Autodesk.Revit.DB.DividedSurface)
Initialize a DividedSurface element
divSurf:

Revit.Elements.DividedSurface.InitDividedSurface(Revit.GeometryReferences.ElementFaceReference,System.Int32,System.Int32,System.Double)
Initialize a DividedSurface element
elementFace:
uDivs:
vDivs:
rotation:

Revit.Elements.DividedSurface.InternalSetDividedSurface(Autodesk.Revit.DB.DividedSurface)
Method to set the internal divided surface, id, and unique id
divSurf:

Revit.Elements.DividedSurface.InternalSetDivisions(System.Int32,System.Int32)
Method to mutate the number of divisions of the internal divided surface.  Will
fail if the divided surface is not set
uDivs:
vDivs:

Revit.Elements.DividedSurface.InternalSetRotation(System.Double)
Method to set the grid rotation of the internal divided surface
rotation:

Revit.Elements.DividedSurface.ByFaceAndUVDivisions(Autodesk.DesignScript.Geometry.Surface,System.Int32,System.Int32)
Create a Revit DividedSurface on a face given the face and number of divisions in u and v directon
elementFace:
uDivs:
vDivs:
Returns:

Revit.Elements.DividedSurface.ByFaceUVDivisionsAndRotation(Autodesk.DesignScript.Geometry.Surface,System.Int32,System.Int32,System.Double)
Create a Revit DividedSurface on a face given the face and number of divisions in u and v directon
and the rotation of the grid lines with respect to the natural UV parameterization of the face
surface:
uDivs:
vDivs:
gridRotation:
Returns:

Revit.Elements.DividedSurface.FromExisting(Autodesk.Revit.DB.DividedSurface,System.Boolean)
Construct this type from an existing Revit element.
dividedSurface:
isRevitOwned:
Returns:

Revit.Elements.DividedSurface.InternalDividedSurface
Internal variable containing the wrapped Revit object

Revit.Elements.DividedSurface.InternalElement
Reference to the Element

Revit.Elements.DividedSurface.UDivisions
Number of divisions in U direction

Revit.Elements.DividedSurface.VDivisions
Number of divisions in V direction

Revit.Elements.DividedSurface.Rotation
Rotation of the grid lines with respect to the UV parameterization
of the face